alert(
  "Задача 3. Морський бій. Ворожий корабель, може знаходитись в одному із квадратів (кількість квадратів вводиться з клавіатури), які розташовані лінійно (один за одним) на річці. Позиція корабля визначається комп’ютером випадковим чином. Гра відбувається за правилами: \n 1) якщо користувач стріляє у заданий квадрат (тобто вводиться номер квадрата), то корабель потоплено; \n 2) якщо корабель знаходиться у сусідньому по відношенню до квадрата, де знаходиться корабель, то корабель пошкоджено (про це повідомляємо користувача). \nЗа два постріли спробувати потопити корабель."
);
const cellsNumber = parseInt(
  prompt("Введіть кількість квадратів для можливого розташування корабля")
);
const shipPosition = 1 + Math.floor(Math.random() * cellsNumber);
let userShot = parseInt(prompt("Введіть номер квадрату"));
if (userShot === shipPosition) {
  document.write(
    `<h1>Вітаємо! Корабель потоплено! Позиція корабля ${shipPosition}</h1>`
  );
} else if (Math.abs(userShot - shipPosition) === 1) {
  alert(`Корабель поранено! Зробіть ще один постріл!`);
  userShot = parseInt(prompt("Введіть номер квадрату"));
  if (userShot === shipPosition)
    document.write(
      `<h1>Вітаємо! Корабель потоплено другим пострілом ! Позиція корабля ${shipPosition}</h1>`
    );
  else
    document.write(
      `<h1>Друга спроба не вдала! Позиція корабля ${shipPosition}</h1>`
    );
} else document.write(`<h1>Не влучили! Позиція корабля ${shipPosition}</h1>`);
